<template>
    <view style="padding: 30upx;">
		<view style="font-size: 18px; font-weight: bold; text-align: center;">用户隐私保护服务协议</view>
		<view style="text-indent: 2em;">“纤畅生技”小程序平台通过以下条款为您提供服务。您应当阅读并遵守《用户隐私保护服务协议》(以下简称为“本协议”），本协议是您与“纤畅生技”小程序之间的法律协议。您在使用“纤畅生技”小程序提供的各项服务之前，请您务必审慎阅读、充分理解各条款内容，特别是隐私保护法律适用的条款。除非您已阅读并接受本协议所有条款，否则您无权使用“纤畅生技”小程序提供的服务。您使用“纤畅生技”小程序的服务即视为您已阅读并同意本协议的约束，包括“纤畅生技”小程序对本协议服务条款随时做的任何修改。</view>
		<view style="text-indent: 2em;">1. 用户在注册账号或使用本服务的过程中，可能需要填写或提交一些必要的信息，如法律法规、规章规范性文件（以下称“法律法规”）规定的需要填写的身份信息。如用户提交的信息不完整或不符合法律法规的规定，则用户可能无法使用本服务或在使用本服务的过程中受到限制。</view>
		<view style="text-indent: 2em;">2. 个人隐私信息是指涉及用户个人身份或个人隐私的信息,比如,用户真实姓名、身份证号、手机号码、手机设备识别码、IP地址、用户聊天记录。非个人隐私信息是指用户对本服务的操作状态以及使用习惯等明确且客观反映在“纤畅生技”小程序服务器端的基本记录信息、个人隐私信息范围外的其它普通信息，以及用户同意公开的上述隐私信息。</view>
		<view style="text-indent: 2em;">3. 尊重用户个人隐私信息的私有性是“纤畅生技”小程序的一贯制度，“纤畅生技”小程序将采取技术措施和其他必要措施，确保用户个人隐私信息安全，防止在本服务中收集的用户个人隐私信息泄露、毁损或丢失。在发生前述情形或者“纤畅生技”小程序发现存在发生前述情形的可能时，将及时采取补救措施。</view>
		<view style="text-indent: 2em;">4. “纤畅生技”小程序未经用户同意不向任何第三方公开、透露用户个人隐私信息。但以下特定情形除外:</view>
		<view style="text-indent: 2em;">(1) “纤畅生技”小程序根据法律法规规定或有权机关的指示提供用户的个人隐私信息;</view>
		<view style="text-indent: 2em;">(2) 由于用户将其用户密码告知他人或与他人共享注册帐户与密码,由此导致的任何个人信息的泄漏，或其他非因“纤畅生技”小程序原因导致的个人隐私信息的泄露;</view>
		<view style="text-indent: 2em;">(3) 用户自行选择向第三方公开其个人信息;</view>
		<view style="text-indent: 2em;">(4) 用户与“纤畅生技”小程序就用户个人信息的使用达成约定;</view>
		<view style="text-indent: 2em;">(5) 任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露;</view>
		<view style="text-indent: 2em;">(6) 本协议约定的其他情形等。</view>
		<view style="text-indent: 2em;">5．用户同意“纤畅生技”小程序可在以下事项中使用用户的个人信息:</view>
		<view style="text-indent: 2em;">(1) “纤畅生技”小程序向用户及时发送重要通知，如软件更新、本协议条款的变更;</view>
		<view style="text-indent: 2em;">(2) “纤畅生技”小程序内部进行审计、数据分析和研究等，以改进“纤畅生技”小程序的产品、服务和与用户之间的沟通;</view>
		<view style="text-indent: 2em;">(3) 依本协议约定，用户公开其个人信息、“纤畅生技”小程序管理、审查用户信息及进行处理措施;</view>
		<view style="text-indent: 2em;">(4) 适用法律法规规定的其他事项。</view>
		<view style="text-indent: 2em;">除上述事项外，如未取得用户同意，“纤畅生技”小程序不会将用户个人隐私信息使用于任何其他用途。</view>
		<view style="text-indent: 2em;">6.为了改善“纤畅生技”小程序的技术和服务，向用户提供更好的服务体验，“纤畅生技”小程序或可会自行收集使用或向第三方提供用户的非个人隐私信息。</view>
    </view>
</template>

<script>
    export default {
        data() {
            return {
				
            }
        },
		onNavigationBarButtonTap(e) {
			// #ifdef APP-PLUS
			
			// #endif 
		},
        methods: {
			
        }
    }
</script>
